Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition
The InputDefinition class is a class for defining the plug-in dependency over the input (points or identifiers).
The user implemented method DefineInput() of the DrawingPluginBase interface should return an array list of
input definition instances. This defines the points and identifiers the plug-in will receive as input
when the Run() method is called.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.Type
The type of the input the current instance contains.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.ViewId
The view object's identifier.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.Initialize
Initializes classes fields.
Returns: Always true.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.#ctor
Base constructor. Initializes all fields. This should be called by all constructors.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.#ctor(Tekla.Structures.Identifier,Tekla.Structures.Geometry3d.Point)
Creates a new input definition instance with one point.
point: The point.
viewId: The identifier for the view object.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.#ctor(Tekla.Structures.Identifier,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new input definition instance with two points.
point1: The first point.
point2: The second point.
viewId: The identifier for the view object.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.#ctor(Tekla.Structures.Identifier,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new input definition instance with three points.
point1: The first point.
point2: The second point.
point3: The third point.
viewId: The identifier for the view object.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.#ctor(Tekla.Structures.Identifier,System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point})
Creates a new input definition with multiple points.
viewId: The view identifier.
points: The points.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.#ctor(Tekla.Structures.Identifier,Tekla.Structures.Identifier)
Creates a new input definition instance with one identifier.
viewId: The identifier for the view object.
ObjectId: The object identifier.

Tekla.Structures.Plugins.DrawingPluginBase.InputDefinition.GetInput
Returns the input Tekla Structures gave to the plug-in. The input is either a point instance,
an identifier instance, an array list of points or an array list of identifiers. This is based on the input
format returned from the DefineInput() method.
Returns: The input to use in the Run() method.